{
    "courseId": "RLeapFROGS",
    "title": "A platform to learn FAIR science practice and publishing",
    "slogan": "An interactive course developed by LinkedEarth",
    "description": "This is a free, open source course on how to use different Data Science Techniques and Tools to make your science FAIR. It is made possible by a grant from the National Science Foundation RISE2324732. Contributions and comments on how to improve the course are welcome! To file an issue go to: https://github.com/LinkedEarth/LeapFROGS/issues",
    "bio": "The sharing of open source data, code, and workflows is fundamental to the building of a FAIR (Findable, Accessible, Interoperable, and Reusable) research ecosystem. Open source tools allow for a community to come together and contribute to the development and improvement of research infrastructure. Such collaborations lead to more robust and efficient solutions, as well as increased transparency and accessibility.The geoscience community is only now beginning to harness the power of the open source model, and formal training on the benefits and proper use of this model is still missing from most geoscience curricula.  While computer science courses may provide some level of training, the technical details often do not align with the specific needs of geoscientists. Our objective is to build human infrastructure to promote reproducible and transparent geoscience by educating geoscientists on the effective utilization of open source resources through practical applications in their own scientific research.",
    "siteUrl": "https://linked.earth/",
    "twitter": "@Linked_Earth",
    "fonts": "IBM+Plex+Mono:500|IBM+Plex+Sans:700|Lato:400,400i,700,700i",
    "testTemplate": "success <- function(text) {\n    cat(paste(\"\\033[32m\", text, \"\\033[0m\", sep = \"\"))\n}\n\n.solution <- \"${solutionEscaped}\"\n\n${solution}\n\n${test}\ntryCatch({\n    test()\n}, error = function(e) {\n    cat(paste(\"\\033[31m\", e[1], \"\\033[0m\", sep = \"\"))\n})",
        "juniper": {
        "repo": "LinkedEarth/RLeapFROGS",
        "branch": "binder",
        "lang": "r",
        "kernelType": "ir",
        "debug": true
    },
    "showProfileImage": true,
    "footerLinks": [
        { "text": "Website", "url": "https://linked.earth/" },
        { "text": "Source", "url": "https://github.com/LinkedEarth/RLeapFROGS" },
        { "text": "Built with ♥", "url": "https://github.com/ines/course-starter-r" }
    ],
    "theme": "#ec625D"
}
